#!/usr/bin/env python
# coding: utf-8

# In[1]:


#1.ครูซื้อขนมตาลมา 30 ห่อ ซื้อขนมกล้วยอีก 15 ห่อนำไปแจกเด็ก 9 คน คนละเท่าๆกัน เด็กจะได้รับขนมคนละกี่ห่อ 
a = int(input("ครูซื้อขนมตาลมา"))
b = int(input("ซื้อขนมกล้วยอีก"))
c = int(input("นำไปแจกเด็ก"))
print("ครูซื้อขนมทั้งหมด",a+b,"ห่อ")
print("นำไปแจกเด็กๆ",(a+b)/c,"ห่อ")


# In[3]:


#2.นุชมีส้ม 400 กิโลกรัม ขายส้มไป 200 กิโลกรัม นุชขายส้มไปกี่กิโลกรัม
a = int(input("นุชมีส้ม"))
b = int(input("ขายส้มไป"))
print("นุชขายส้มไปกี่กิโลกรัม",a-b,"กิโลกรัม")


# In[4]:


#3.ซื้อส้มโอ 12 ผล ราคาผลละ 35 บาท จะต้องจ่ายกี่บาท ?
a= int(input("ซื้อส้มโอ"))
b= int(input("ราคาผลละ"))
print("ส้มโอ 12 ผลราคา",a*b,"บาท")


# In[5]:


#4.ร้ายขายโทรศัพท์แห่งหนึ่งมีโปรโมชั่นซื้อ2เครื่องขึ้นไปจะลดให้50%
A = int(input("จำนวนโทรศัพท์"))
money = int(input("ราคา"))
total = 0
if A>2:
    total = money-(money*0.5)
    print("ราคาที่ต้องจ่าย",total)
else:
    print("ราคาที่ต้องจ่าย",money,"บาท")


# In[15]:


#5.ให้ลดจำนวน5 โดยเริ่มต้นจาก 50
i = 50
while i >= 0:
    print(i, end = ', ')
    i = i - 5


# In[16]:


#6.ให้เขียนรับตัวเลขฐาน 2 จากผู้ใช้ จากนั้นแปลงให้เป็นเลขฐานสิบ
x = input("ใส่เลขฐาน 2: ")
d = len(x)-1
sum = 0
for y in x:
   if y == '1':
      sum = sum+2**d
   d = d-1
print(sum)


# In[21]:


#7.พื้นที่วงกลม
import math
radius = int(input("ค่ารัศมี:"))
result = 2*math.pi*radius
print("พื้นที่วงกลม =", result)


# In[22]:


#8. หาว่าตัวเลขที่หารจำนวนที่กำหนดนั้นหารลงตัวหรือไม่
number = int(input("ตัวตั้งหาร :"))
n = int(input("ตัวตั้งหาร :"))
if n % number == 0:
    print("หารลงตัว")
else:
    print("หารไม่ลงตัว")


# In[25]:


#9.ให้เขียนโปรแกรมรับจำนวนเต็ม A และ B จากนั้นพิมพ์เลขตั้งแต่ 1 ถึง A ที่ B หารลงตัว
A = int(input("Enter A: "))
B= int(input("Enter B: "))
for x in range(1,A+1):
   if  x%B == 0:
      print(x)


# In[26]:


#10.จงหาผลบวกตั้งแต่ 1 ถึง n
sum= 0
n = int(input("กำหนดค่า n ="))
for i in range(1,n+1):
    sum += 1
    print("ผลรวม =",sum)


# In[ ]:




